In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('1.5_homework.csv')

In [3]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [13]:
data.query("lunch == 'free/reduced'")['lunch'].count() / data.shape[0]

0.355

In [15]:
data.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [26]:
data.query("lunch == 'free/reduced'").var()

C:\Users\baben_bakg1j1\AppData\Local\Temp\ipykernel_17272\4115041300.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.query("lunch == 'free/reduced'").var()

math score       229.824270
reading score    221.871139
writing score    238.202881
dtype: float64

In [27]:
data.query("lunch == 'standard'").var()

C:\Users\baben_bakg1j1\AppData\Local\Temp\ipykernel_17272\502164154.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.query("lunch == 'standard'").var()

math score       186.418089
reading score    191.285560
writing score    205.620887
dtype: float64

In [30]:
data.groupby('lunch').agg(['mean', 'var']).T

C:\Users\baben_bakg1j1\AppData\Local\Temp\ipykernel_17272\4035197762.py:1: FutureWarning: ['gender', 'race/ethnicity', 'parental level of education', 'test preparation course'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  data.groupby('lunch').agg(['mean', 'var']).T

lunch               free/reduced    standard
math score    mean     58.921127   70.034109
              var     229.824270  186.418089
reading score mean     64.653521   71.654264
              var     221.871139  191.285560
writing score mean     63.022535   70.823256
              var     238.202881  205.620887

In [35]:
data.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')